Autodesk.Revit.DB.BuiltInFailures.MassFailures.UpgradedMassingWarning
Your document contained a Massing element which has been upgraded to a Mass instance.  Please review the documentation on the new enhanced Mass capabilities to understand the implications of this change.

Autodesk.Revit.DB.BuiltInFailures.MassFailures.TooManyGeometries
The geometry in this Mass instance is too complex to take advantage of the capabilities a Mass provides.  Please break it down into multiple Mass and family instances that are less complex.

Autodesk.Revit.DB.BuiltInFailures.MassFailures.SplitOverlappingFacesFailed
Failed to resolve all overlaps between faces of the same Mass Energy Analytical Model.

Autodesk.Revit.DB.BuiltInFailures.MassFailures.SplitFacesByGroundPlaneFailed
Failed to split face by ground plane.

Autodesk.Revit.DB.BuiltInFailures.MassFailures.SplitFacesByGroundPlaneCrashed
Failed to split face by ground plane.

Autodesk.Revit.DB.BuiltInFailures.MassFailures.SketchCurveNotModelable
This action cannot be completed.  An element created by massing has a sketch line that cannot be modeled.

Autodesk.Revit.DB.BuiltInFailures.MassFailures.OverlappingSolids
Found volumetric overlap between solids. They will be merged into one

Autodesk.Revit.DB.BuiltInFailures.MassFailures.OpenGeometryOnly
Mass contains only mesh geometry, which can't be used to compute Mass Floors, volume, or surface area.

Autodesk.Revit.DB.BuiltInFailures.MassFailures.OpenAndSolidGeometry
Mass contains both solid and mesh geometry.  Mass Floors, volume, and surface area, may appear incorrect.

Autodesk.Revit.DB.BuiltInFailures.MassFailures.NonOccupiableMassZone
For mass zone, if the bottom level ref does not intersect, then this zone is going to be "not occupiable" and a warning is posted for it.

Autodesk.Revit.DB.BuiltInFailures.MassFailures.NoSolidInMass
Mass contains no solid geometry. Mass Floors, volume, and surface area, won't be computed.

Autodesk.Revit.DB.BuiltInFailures.MassFailures.NoCurtainRoofsInMassing
Massing cannot be created with a curtain roof.  Please change the default roof type and try again.

Autodesk.Revit.DB.BuiltInFailures.MassFailures.MultipleMassing
Can't complete operation. Massing can only exist in one Workset. Change Workset of Massing to match in Local and Central Models.

Autodesk.Revit.DB.BuiltInFailures.MassFailures.MinSkylightWidthMetric
The minimum skylight width is 203.2 millimeters.

Autodesk.Revit.DB.BuiltInFailures.MassFailures.MinSkylightWidthImperial
The minimum skylight width is 8 inches.

Autodesk.Revit.DB.BuiltInFailures.MassFailures.FloorMightLookWrong
Mass Floors may appear incorrect since the Mass contains mesh and solid geometry.

Autodesk.Revit.DB.BuiltInFailures.MassFailures.FloorAreaFaceFailed
Failed to create a Mass Floor.

Autodesk.Revit.DB.BuiltInFailures.MassFailures.FaceSplitFailed
A face of a joined (i.e. one cuts another) mass could not be split into interior and exterior faces. Remove the cut to resolve.

Autodesk.Revit.DB.BuiltInFailures.MassFailures.FaceRegionCreationFailed
Failure in face region creation.

Autodesk.Revit.DB.BuiltInFailures.MassFailures.DividePerimeterZoneFailed
Failed to divide perimeter zone.

Autodesk.Revit.DB.BuiltInFailures.MassFailures.CreateCoreGeometryFailed
Failed to create core geometries.

Autodesk.Revit.DB.BuiltInFailures.MassFailures.CannotMoveMassing
Can't move whole Massing. Move the elements within the Massing instead.

Autodesk.Revit.DB.BuiltInFailures.MassFailures.CannotMergeGeometry
The Mass contains geometry that cannot be combined.   Mass Floors, volume, and surface area, won't be computed.

Autodesk.Revit.DB.BuiltInFailures.MassFailures.CannotIntegrate
In order to restore an element's 'Constrain to Massing' property to 'Dependent', it must be in the main model with the massing.

Autodesk.Revit.DB.BuiltInFailures.MassFailures.BooleanUnionFailed
Failed to merge overlapping solids

Autodesk.Revit.DB.BuiltInFailures.MassFailures.AutoGlazingFailedError
Failure in Auto-Glazing region computation.

Autodesk.Revit.DB.BuiltInFailures.MassFailures.AutoGlazingFailed
Failure in Auto-Glazing region computation.

Autodesk.Revit.DB.BuiltInFailures.MassFailures
Failures about Mass.